app/controllers/sessions_controller.rb

INSERT INTO `users` (`created_at`, `nickname`, `provider`, `secret`, `token`, `uid`, `updated_at`) VALUES ('2011-07-23 03:55:20', 'Bardan Rana', 'facebook', NULL, '240339599322007|841efc8065113dd9817a124f.1-1097730367|73JjTU1Icj37Wd-ouPiSlWpC72s', '1097730367', '2011-07-23 03:55:20') (pid:3398)
SELECT `users`.* FROM `users` WHERE `users`.`provider` = 'twitter' AND `users`.`uid` = '267078377' LIMIT 1 (pid:2519)
---
  def create
    auth = request.env['omniauth.auth']
    #raise auth.to_yaml
    user = User.find_by_provider_and_uid(auth['provider'], auth['uid']) || User.create_with_omniauth(auth)